# Pandas

In [5]:
import pandas as pd

In [8]:
seri = pd.Series([1, 2, 3, 4, 5])
seri

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
type(seri)

pandas.core.series.Series

In [10]:
seri.size

5

In [11]:
seri.ndim

1

In [12]:
seri.dtype

dtype('int64')

In [13]:
seri.values

array([1, 2, 3, 4, 5], dtype=int64)

In [15]:
seri.head() # ilk 5 veri

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
seri.head(3)

0    1
1    2
2    3
dtype: int64

In [17]:
seri.tail() # son 5 veri

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [19]:
pd.Series([99,34,24,65,35], index = [1,3,5,7,9])

1    99
3    34
5    24
7    65
9    35
dtype: int64

In [20]:
seri = pd.Series([4,2,8,0,3], index = ["a", "b", "c", "d", "e"])

In [21]:
seri

a    4
b    2
c    8
d    0
e    3
dtype: int64

In [22]:
seri["a"]

4

In [23]:
seri["a": "c"]

a    4
b    2
c    8
dtype: int64

In [24]:
#sözlük üzerinden liste oluşturmak

In [25]:
sozluk = pd.Series({"reg": 10, "log": 12, "cart": 14})

In [26]:
sozluk

reg     10
log     12
cart    14
dtype: int64

In [27]:
sozluk = {"reg": 10, "log": 12, "cart": 14}

In [28]:
pd.Series(sozluk)

reg     10
log     12
cart    14
dtype: int64

In [29]:
pd.concat([seri, seri])

a    4
b    2
c    8
d    0
e    3
a    4
b    2
c    8
d    0
e    3
dtype: int64

In [30]:
import numpy as np

In [31]:
a = np.array([22,5,3,2,80])

In [33]:
b = pd.Series(a)
b

0    22
1     5
2     3
3     2
4    80
dtype: int32

In [34]:
b[0]

22

In [35]:
b[0:3]

0    22
1     5
2     3
dtype: int32

In [37]:
seri = pd.Series([3, 4, 2, 8], index = ["reg", "loj", "cart", "rf"])

In [38]:
seri

reg     3
loj     4
cart    2
rf      8
dtype: int64

In [40]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [41]:
seri.keys

<bound method Series.keys of reg     3
loj     4
cart    2
rf      8
dtype: int64>

In [42]:
list(seri.items())

[('reg', 3), ('loj', 4), ('cart', 2), ('rf', 8)]

In [43]:
'reg' in seri

True

In [44]:
"log" in seri

False

In [45]:
"loj" in seri

True

In [46]:
seri["reg"]

3

In [47]:
# fancy eleman

In [48]:
seri[["reg", "loj"]]

reg    3
loj    4
dtype: int64

In [51]:
seri["reg":"cart"]

reg     3
loj     4
cart    2
dtype: int64

# Pandas DataFrame oluşturma

In [56]:
l = [1, 2, 39, 67, 90]
l

[1, 2, 39, 67, 90]

In [59]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [8]:
import numpy as np
import pandas as pd

In [6]:
m = np.arange(1, 10).reshape(3,3)

In [9]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [10]:
# df isimlendirme

In [11]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [14]:
df.shape

(3, 3)

In [15]:
df.ndim

2

In [16]:
df.size

9

In [17]:
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [18]:
df.tail(1)

   var1  var2  var3
2     7     8     9

In [19]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [20]:
type(df.values)

numpy.ndarray

In [21]:
a = np.array([1, 2, 3, 4, 5])

In [22]:
pd.DataFrame(a, columns = ["value"])

   value
0      1
1      2
2      3
3      4
4      5

In [24]:
a1  = np.random.randint(10, size = 5)
a2 = np.random.randint(10, size = 5)
a3 = np.random.randint(10, size = 5)

In [25]:
sozluk = {"var1": a1, "var2": a2, "var3": a3}

In [26]:
sozluk

{'var1': array([1, 6, 0, 8, 2]),
 'var2': array([4, 7, 2, 9, 9]),
 'var3': array([6, 5, 0, 8, 1])}

In [28]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     1     4     6
1     6     7     5
2     0     2     0
3     8     9     8
4     2     9     1

In [30]:
df[0:1]

   var1  var2  var3
0     1     4     6

In [31]:
df[0:3]

   var1  var2  var3
0     1     4     6
1     6     7     5
2     0     2     0

In [32]:
df.index = ["a", "b", "c", "d", "e"]

In [33]:
df

   var1  var2  var3
a     1     4     6
b     6     7     5
c     0     2     0
d     8     9     8
e     2     9     1

In [35]:
df["a":"c"]

   var1  var2  var3
a     1     4     6
b     6     7     5
c     0     2     0

In [36]:
#silme

In [40]:
df.drop("a", axis = 0)

   var1  var2  var3
b     6     7     5
c     0     2     0
d     8     9     8
e     2     9     1

In [39]:
df

   var1  var2  var3
a     1     4     6
b     6     7     5
c     0     2     0
d     8     9     8
e     2     9     1

In [49]:
df.drop("b", axis = 0, inplace = True) # kalıcı olarak gitti

In [50]:
df

   var1  var2  var3
c     0     2     0
d     8     9     8
e     2     9     1

In [54]:
k = ["d", "e"]

In [55]:
df.drop(k, axis = 0)

   var1  var2  var3
c     0     2     0

In [56]:
df

   var1  var2  var3
c     0     2     0
d     8     9     8
e     2     9     1

In [60]:
"var1" in df

True

In [59]:
8 in df

False

In [61]:
l = ["var1", "var2", "var3"]

In [63]:
for i in l:
    print(i in df)

True
True
True

In [67]:
l = ["var1", "var4", "var3"]

In [68]:
for i in l:
    print(i in df)

True
False
True

In [69]:
df["var4"] = df["var1"] / df["var2"]

In [70]:
df

   var1  var2  var3      var4
c     0     2     0  0.000000
d     8     9     8  0.888889
e     2     9     1  0.222222

# Birleştirme (Join) İşlemleri

In [5]:
import pandas as pd
import numpy as np
m = np.random.randint(1,30, size = (5,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    10    24    29
1    20     1     1
2    21    29     7
3    20     5    21
4    10    14    20

In [7]:
df2 = df + 99
df2

   var1  var2  var3
0   109   123   128
1   119   100   100
2   120   128   106
3   119   104   120
4   109   113   119

In [12]:
df3 = pd.concat([df, df2])
df3

   var1  var2  var3
0    10    24    29
1    20     1     1
2    21    29     7
3    20     5    21
4    10    14    20
0   109   123   128
1   119   100   100
2   120   128   106
3   119   104   120
4   109   113   119

In [13]:
df2

   var1  var2  var3
0   109   123   128
1   119   100   100
2   120   128   106
3   119   104   120
4   109   113   119

In [2]:
import pandas as pd
import numpy as np

In [3]:
a = np.random.randint(1, 30, size = (5,3))

In [5]:
df1 = pd.DataFrame(a, columns = ["var1", "var2", "var3"])

In [6]:
df2 = pd.DataFrame(a, columns = ["var1", "var2", "var3"])

In [8]:
pd.concat([df1, df2]) # default olarak ignore_index = False

   var1  var2  var3
0     9    16     3
1     8     7     4
2    14    28    28
3    22     4    17
4    10    22     6
0     9    16     3
1     8     7     4
2    14    28    28
3    22     4    17
4    10    22     6

In [10]:
pd.concat([df1, df2], ignore_index = True)

   var1  var2  var3
0     9    16     3
1     8     7     4
2    14    28    28
3    22     4    17
4    10    22     6
5     9    16     3
6     8     7     4
7    14    28    28
8    22     4    17
9    10    22     6

In [11]:
df1

   var1  var2  var3
0     9    16     3
1     8     7     4
2    14    28    28
3    22     4    17
4    10    22     6

In [12]:
df2

   var1  var2  var3
0     9    16     3
1     8     7     4
2    14    28    28
3    22     4    17
4    10    22     6

In [14]:
df2 = pd.DataFrame(a, columns = ["var1", "var2", "deg3"])

In [16]:
pd.concat([df1, df2])

   var1  var2  var3  deg3
0     9    16   3.0   NaN
1     8     7   4.0   NaN
2    14    28  28.0   NaN
3    22     4  17.0   NaN
4    10    22   6.0   NaN
0     9    16   NaN   3.0
1     8     7   NaN   4.0
2    14    28   NaN  28.0
3    22     4   NaN  17.0
4    10    22   NaN   6.0

In [18]:
pd.concat([df1, df2], join = "inner") # sadece kesişenleri yazdırır.

   var1  var2
0     9    16
1     8     7
2    14    28
3    22     4
4    10    22
0     9    16
1     8     7
2    14    28
3    22     4
4    10    22

# İleri Birleştirme İşlemleri

In [20]:
# Birebir birleştirme

In [25]:
df1 = pd.DataFrame({'calisanlar': ["Ali", "Veli", "Ayse", "Fatma"],
                   'grup': ['Muhasebe', 'Mühendislik', 'Mühendislik', 'İK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3      Fatma           İK

In [26]:
df2 = pd.DataFrame({'calisanlar': ["Ali", "Veli", "Ayse", "Fatma"],
                   'ilk_giris': [2010, 2019, 2014, 2019]})
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2019
2       Ayse       2014
3      Fatma       2019

In [27]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Mühendislik       2019
2       Ayse  Mühendislik       2014
3      Fatma           İK       2019

In [28]:
pd.merge(df1, df2, on = "calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Mühendislik       2019
2       Ayse  Mühendislik       2014
3      Fatma           İK       2019

# Toplulaştırma ve Gruplama (Aggregation & Grouping)

Basit toplulaştırma fonksiyonları:

**count()**

**first()**

**last()**

**mean()**

**median()**

**min()**

**max()**

**std()**

**var()**

**sum()**

In [31]:
import seaborn as sns

In [32]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\esraz\anaconda3\envs\myenv\lib\site-packages\seaborn\utils.py
Type:      function

In [34]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [35]:
df.shape

(1035, 6)

In [40]:
df.mean

<bound method DataFrame.mean of                method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]>

In [37]:
df["mass"].mean()

2.6381605847953216

In [41]:
df["mass"].count()

513

In [42]:
df["mass"].min()

0.0036

In [44]:
df["mass"].max()

25.0

In [45]:
df["mass"].sum()

1353.37638

In [46]:
df["mass"].std()

3.8186166509616046

In [47]:
df["mass"].var()

14.58183312700122

In [48]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [16]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [50]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'veri' : [10, 11, 52, 23, 43, 55]}, columns = ['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [5]:
df.groupby("gruplar")

In [7]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [8]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [11]:
import seaborn as sns
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [12]:
df.groupby("method")

In [14]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [15]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [1]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'degisken1': [10, 23, 33, 22, 11, 99],
                  'degisken2': [100, 253, 333, 262, 111, 969]},
                 columns = ['gruplar', 'degisken1', 'degisken2'])

df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [2]:
#aggregate

In [4]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [2]:
#Filter

In [4]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'degisken1': [10, 23, 33, 22, 11, 99],
                  'degisken2': [100, 253, 333, 262, 111, 969]},
                 columns = ['gruplar', 'degisken1', 'degisken2'])

df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969